{
    "'Abd": {
        "definition": "A male slave.",
        "arabic": "العبد"
    },
    "'Ad": {
        "definition": "An ancient tribe that lived after Noah. It was prosperous, but naughty and disobedient to Allah, so Allah destroyed it with violent destructive westerly wind.",
        "arabic": "عاد"
    },
    "(Ad) Dabur": {
        "definition": "Westerly wind.",
        "arabic": "دبور"
    },
    "(Ad) Dajjal": {
        "definition": "Pseudo Messiah (Al-Masih-ad-Dajjal) and also Hadith No.649 and 650, Vol.4, Sahih Al-Bukhari.",
        "arabic": "الدجال"
    },
    "Adhan": {
        "definition": "The call to prayer pronounced loudly to indicate that the time of praying is due. And it is as follows: Allahu Akbar, Allahu-Akbar; Allahu-Akbar, Allahu-Akbar; Ash-hadu an la ilaha ill Allah, Ash-hadu an la ilaha ill Allah; Ash-hadu anna Muhammadan Rasul-Ullah, Ash-hadu anna Muhammadan Rasul-Ullah; Haiya 'alas-Sala(h), Haiya'alas-Sala(h); Haiya 'alal-Falah, Haiya 'alal-Falah; Allahu-Akbar, Allahu-Akbar; La ilaha ill Allah.",
        "arabic": "الأذان"
    },
    "Adhkhar or Idhkhir": {
        "definition": "A kind of grass well-known for its good smell and is found in Hijaz, Saudi Arabia.",
        "arabic": "الإذخر"
    },
    "Ahkam": {
        "definition": "Orders. According to Islamic Law, there are five kinds of orders: 1. Compulsory (Wajib) 2. Order without obligation (Mustahab) 3. Forbidden (Muharram) 4. Disliked but not forbidden (Makruh) 5. Legal and allowed (Halal)",
        "arabic": "الأحكام"
    },
    "'Ajwa": {
        "definition": "Pressed soft dates (or a kind of dates).",
        "arabic": "العجوة"
    },
    "Al-Ahzab": {
        "definition": "Confederates.",
        "arabic": "الأحزاب"
    },
    "Al-'Aqiq": {
        "definition": "A valley in Al-Madina about seven kilometers west of Al-Madina.",
        "arabic": "العقيق"
    },
    "Al-'Amanah": {
        "definition": "The trust or the moral responsibility or honesty, and all the duties which Allah has ordained.",
        "arabic": "الأمانة"
    },
    "Al-'Awamir": {
        "definition": "Snakes living in houses.",
        "arabic": "العوامر"
    },
    "Al-Bahira": {
        "definition": "A milking she-camel, whose milk used to be spared for idols and other false deities.",
        "arabic": "البحيرة"
    },
    "Al-Baida'": {
        "definition": "A place to the south of Al-Madina on the way to Makka.",
        "arabic": "البيداء"
    },
    "Al-Bait-ul-Ma'mur": {
        "definition": "Allah's House over the seventh heaven.",
        "arabic": "البيت المعمور"
    },
    "Al-Batsha": {
        "definition": "Grasp.",
        "arabic": "البطشة"
    },
    "Al-Fatiha": {
        "definition": "The first Surah in the Qur'an.",
        "arabic": "الفاتحة"
    },
    "Al-Firdaus": {
        "definition": "The middle and the highest part of Paradise.",
        "arabic": "الفردوس"
    },
    "Al-Ghaba": {
        "definition": "(Literally: the forest) A well-known place near Al-Madina.",
        "arabic": "الغابة"
    },
    "Al-Ghurr-ul-Muhajjalun": {
        "definition": "A name that will be given on the Day of Resurrection to the Muslims because the parts of their bodies which they used to wash in ablution will shine then.",
        "arabic": "الغُرّ المُحَجَّلون"
    },
    "Al-Haruriyya": {
        "definition": "A special unorthodox religious sect.",
        "arabic": "الحرورية"
    },
    "Al-Hasba": {
        "definition": "A place outside Makka where pilgrims go after finishing all the ceremonies of Hajj.",
        "arabic": "الحصبة"
    },
    "Al-Hijr": {
        "definition": "The unroofed portion of the Ka'ba which at present is in the form of a compound towards the north of the Ka'ba.",
        "arabic": "الحِجر"
    },
    "Al-Hudaibiya": {
        "definition": "A well-known place ten miles from Makka on the way to Jeddah.",
        "arabic": "الحديبية"
    },
    "Al-Ihtiba'": {
        "definition": "A sitting posture, putting one's arms around one's legs while sitting on the hips.",
        "arabic": "الإحتباء"
    },
    "Al-Ji'rana": {
        "definition": "A place, a few miles from Makka. The Prophet distributed the war booty of the battle of Hunain there, and from there he assumed the state of Ihram to perform 'Umra.",
        "arabic": "الجعرانة"
    },
    "Al-Juhfa": {
        "definition": "The Miqat of the people of Sham.",
        "arabic": "الجحفة"
    },
    "Al-Kaba'ir": {
        "definition": "The biggest sins.",
        "arabic": "الكبائر"
    },
    "Ghazwat-al-Khandaq": {
        "definition": "The name of a battle between the early Muslims and the infidels in which the Muslims dug a Khandaq (trench) around Al-Madina to prevent any advance by the enemies.",
        "arabic": "غزوة الخندق"
    },
    "Al-Kauthar": {
        "definition": "A river in Paradise.",
        "arabic": "الكوثر"
    },
    "Al-Lat & Al-'Uzza": {
        "definition": "Well-known idols in Hijaz which used to be worshipped during the Pre-Islamic Period of Ignorance.",
        "arabic": "اللات والعزى"
    },
    "Al-Lizam": {
        "definition": "The settlement of affairs, in the Hadith, it refers to the battle of Badr, which was the means of settling affairs between the Muslims and the pagans.",
        "arabic": "اللزام"
    },
    "Al-Madina": {
        "definition": "A well-known town in Saudi Arabia, where the Prophet's mosque is situated.",
        "arabic": "المدينة"
    },
    "Al-Maghazi": {
        "definition": "Plural of Ghazwa (i.e. holy battle).",
        "arabic": "المغازي"
    },
    "Al-Mahassab": {
        "definition": "A valley outside Makka sometimes called Khaif Bani Kinana.",
        "arabic": "المحصب"
    },
    "Al-Manasi": {
        "definition": "A vast plateau on the outskirts of Al-Madina.",
        "arabic": "المناسي"
    },
    "Al-Masjid-al-Aqsa": {
        "definition": "The great mosque in Jerusalem.",
        "arabic": "المسجد الأقصى"
    },
    "Al-Masjid-al-Haram": {
        "definition": "The great mosque in Makka. The Ka'ba is situated in it.",
        "arabic": "المسجد الحرام"
    },
    "Al-Mut'a": {
        "definition": "A temporary marriage which was allowed in the early period of Islam but later abrogated.",
        "arabic": "المتعة"
    },
    "Al-Muta'awwilun": {
        "definition": "Those who form wrong opinions of Kufr about their Muslim brothers.",
        "arabic": "المتأولون"
    },
    "Al-Qasama": {
        "definition": "The oath taken by 50 men of the tribe of a person who is being accused of killing somebody.",
        "arabic": "القسامة"
    },
    "Al-Qaswa'": {
        "definition": "The name of the Prophet's (Peace Be Upon Him) she-camel.",
        "arabic": "القصواء"
    },
    "Al-Qisas": {
        "definition": "Laws of equality in punishment for wounds etc. in retaliation.",
        "arabic": "القصاص"
    },
    "Al-Wasil": {
        "definition": "One who keeps good relations with his kith and kin.",
        "arabic": "الواصل"
    },
    "Al-Yarmuk": {
        "definition": "A place in Sham.",
        "arabic": "اليرموك"
    },
    "Allahu-Akbar": {
        "definition": "Allah is the Most Great.",
        "arabic": "الله أكبر"
    },
    "Ama": {
        "definition": "A female slave.",
        "arabic": "الأمة"
    },
    "Amin": {
        "definition": "O Allah, accept our invocation.",
        "arabic": "آمين"
    },
    "Amma Ba'du": {
        "definition": "An expression used for separating an introductory from the main topics in a speech; the introductory being usually concerned with Allah's Praises and Glorification. Literally, it means, 'whatever comes after.'",
        "arabic": "أما بعد"
    },
    "An-Najashi": {
        "definition": "Title for the king of Ethiopia.",
        "arabic": "النجاشي"
    },
    "An-Najash": {
        "definition": "A trick of offering a very high price for something without the intention of buying it but just to allure and cheat somebody else who really wants to buy it although it is not worth such a high price.",
        "arabic": "النجش"
    },
    "An-Najwa": {
        "definition": "The private talk between Allah and each of His slaves on the Day of Resurrection. It also means a secret counsel or conference or consultation.",
        "arabic": "النجوى"
    },
    "Ansari": {
        "definition": "The Companions of the Prophet from the inhabitants of Al-Madina, who embraced Islam and supported it and who received and entertained the Muslim emigrants from Makka and other places.",
        "arabic": "الأنصاري"
    },
    "'Anza": {
        "definition": "A spear-headed stick.",
        "arabic": "العنزة"
    },
    "'Aqiqa": {
        "definition": "It is the sacrificing of one or two sheep on the occasion of the birth of a child, as a token of gratitude to Allah.",
        "arabic": "العقيقة"
    },
    "'Aqra Halqa": {
        "definition": "An exclamatory expression, the literal meaning of which is not always meant. It expresses disapproval.",
        "arabic": "أقرع حلق"
    },
    "'Arafat": {
        "definition": "A famous place of pilgrimage on the south-east of Makka about twenty-five kilometers from it.",
        "arabic": "عرفات"
    },
    "Arak": {
        "definition": "A tree from which Siwak (toothbrush) is made.",
        "arabic": "الأراك"
    },
    "'Ariya (plural 'Araya)": {
        "definition": "Bai'-al-'Araya is a kind of sale by which the owner of an 'Ariya is allowed to sell the fresh dates while they are still over the palms by means of estimation, for dried plucked dates.",
        "arabic": "العرايا"
    },
    "Ar-Rajm": {
        "definition": "Means in Islamic Law to stone to death those married persons who commit the crime of illegal sexual intercourse.",
        "arabic": "الرجم"
    },
    "'Arsh": {
        "definition": "Compensation given in case of someone's injury caused by another person.",
        "arabic": "العرش"
    },
    "Ar-Ruqya": {
        "definition": "Divine Speech recited as a means of curing disease.",
        "arabic": "الرقية"
    },
    "'Asaba": {
        "definition": "All male relatives of a deceased person, from the father's side.",
        "arabic": "العصبة"
    },
    "'Asb": {
        "definition": "A kind of Yemeni cloth that is very coarse.",
        "arabic": "العصب"
    },
    "Ash-Shajara": {
        "definition": "A well-known place on the way from Al-Madina to Makka.",
        "arabic": "الشجرة"
    },
    "Ash-Shiqaq": {
        "definition": "Difference between husband and wife.",
        "arabic": "الشقاق"
    },
    "'Ashura": {
        "definition": "The 10th of the month of Muharram, the first month in the Islamic calendar.",
        "arabic": "عاشوراء"
    },
    "'Asr": {
        "definition": "Afternoon, 'Asr prayer time.",
        "arabic": "العصر"
    },
    "As-Saba": {
        "definition": "Easterly wind.",
        "arabic": "الصبا"
    },
    "As-Sa'iba": {
        "definition": "A she-camel which used to be let loose for free pastures in the name of idols, gods, and false deities.",
        "arabic": "السايبة"
    },
    "As-Saum": {
        "definition": "The fasting, i.e., to not eat or drink or have sexual relations etc. from before the Adhan of the Fajr (early morning) prayer till the sunset.",
        "arabic": "الصوم"
    },
    "As-Sirat": {
        "definition": "Sirat originally means 'a road'; it also means the bridge that will be laid across Hell-Fire for the people to pass over on the Day of Judgement.",
        "arabic": "الصراط"
    },
    "Ashab As-Suffa": {
        "definition": "They were about eighty men or more who used to stay and have religious teachings in the Prophet's mosque in Al-Madina, and they were very poor people.",
        "arabic": "أصحاب الصفة"
    },
    "At-Tan'im": {
        "definition": "A place towards the north of Makka outside the sanctuary from where Makkans may assume the state of Ihram to perform 'Umra.",
        "arabic": "التنعيم"
    },
    "'Aura": {
        "definition": "That part of the body which it is illegal to keep naked before others.",
        "arabic": "العورة"
    },
    "'Awali-al-Madina": {
        "definition": "Outskirts of Al-Madina at a distance of four or more miles.",
        "arabic": "عوالي المدينة"
    },
    "Awaqin": {
        "definition": "Singular: Uqiyya: 5 Awaqin = 22 Silver Riyals of Yemen or 200 Silver Dirham (i.e. 640 grams approx.).",
        "arabic": "أواقين"
    },
    "Awsaq": {
        "definition": "Plural of Wasq, which is a measure equal to 60 Sa's = 135 kgms. 1 Sa' = 3 kilograms (approx). It may be less or more.",
        "arabic": "أوساق"
    },
    "Ayat": {
        "definition": "Proofs, evidences, verses, lessons, signs, revelations, etc.",
        "arabic": "آيات"
    },
    "Ayat-ul-Kursi": {
        "definition": "Qur'anic Verse No. 255 of Surat Al-Baqara.",
        "arabic": "آية الكرسي"
    },
    "Azlam": {
        "definition": "Literally means 'arrows'. Here it means arrows used to seek good luck or a decision, practised by the 'Arabs of Pre-Islamic Period of Ignorance.",
        "arabic": "الأزلام"
    },
    "Badana": {
        "definition": "Plural: Budn. A camel or a cow or an ox driven to be offered as a sacrifice by the pilgrims at the sanctuary of Makka.",
        "arabic": "بدنة"
    },
    "Badr": {
        "definition": "A place about 150 kilometers to the south of Al-Madina, where the first great battle in Islamic history took place between the early Muslims and the infidels of Quraish.",
        "arabic": "بدر"
    },
    "Badhaq": {
        "definition": "A kind of alcoholic drink prepared from grapes.",
        "arabic": "بدق"
    },
    "Bai'a (pledge)": {
        "definition": "A pledge given by the citizens etc. to their Imam (Muslim ruler) to be obedient to him according to the Islamic religion.",
        "arabic": "بيعة"
    },
    "Bait-ul-Midras": {
        "definition": "A place in Al-Madina (and it was a Jewish centre).",
        "arabic": "بيت المدراس"
    },
    "Bait-ul-Maqdis": {
        "definition": "Bait' literally means 'House': a mosque is frequently called Baitullah (the House of Allah). Bait-ul-Maqdis is the famous mosque in Jerusalem which is regarded as the third greatest mosque in the Islamic world; the first and second being Al-Masjid Al-Haram at Makka and the mosque of the Prophet at Al-Madina, respectively.",
        "arabic": "بيت المقدس"
    },
    "Banu Al-Asfar": {
        "definition": "The Byzantines.",
        "arabic": "بنو الأصفر"
    },
    "Balam": {
        "definition": "Means an ox.",
        "arabic": "بلام"
    },
    "Barrah": {
        "definition": "Pious.",
        "arabic": "برة"
    },
    "Baqi'": {
        "definition": "The cemetery of the people of Al-Madina; many of the companions of the Prophet are buried in it.",
        "arabic": "بقيع"
    },
    "Bid'a": {
        "definition": "Heresy or any innovated practice in religion.",
        "arabic": "بدعة"
    },
    "Bint Labun": {
        "definition": "Two-year-old she-camel.",
        "arabic": "بنت لبون"
    },
    "Bint Makhad": {
        "definition": "One-year-old she-camel.",
        "arabic": "بنت مخاض"
    },
    "Bu'ath": {
        "definition": "A place about two miles from Al-Madina where a battle took place between the Ansar tribes of Al-Aus and Al-Khazraj before Islam.",
        "arabic": "بعاث"
    },
    "Buraq": {
        "definition": "An animal bigger than a donkey and smaller than a horse on which the Prophet went for the Mi'raj (The Ascent of the Prophet to the heavens).",
        "arabic": "البراق"
    },
    "Burd, Burda": {
        "definition": "A black square narrow dress.",
        "arabic": "بردة"
    },
    "Burnus": {
        "definition": "A hooded cloak.",
        "arabic": "برنس"
    },
    "Burud": {
        "definition": "Plural of Barid, which means sixteen Farsakhs.",
        "arabic": "بُرُد"
    },
    "Buthan": {
        "definition": "A valley in Al-Madina.",
        "arabic": "بُثَان"
    },
    "Caliph": {
        "definition": "The Imam or the Muslim ruler.",
        "arabic": "الخليفة"
    },
    "Caliphate": {
        "definition": "The Muslim state.",
        "arabic": "الخلافة"
    },
    "Daghabis": {
        "definition": "Snake cucumbers. It is a plural of Daghbus.",
        "arabic": "دغابيس"
    },
    "Daiyan": {
        "definition": "Allah; it literally means the One Who judges people from their deeds after calling them to account.",
        "arabic": "ديان"
    },
    "Daniq": {
        "definition": "A coin equal to one sixth of a Dirham.",
        "arabic": "دانق"
    },
    "Dar-al-Qada'": {
        "definition": "Justice House (court).",
        "arabic": "دار القضاء"
    },
    "Day of Nafr": {
        "definition": "The 12th or 13th of Dhul-Hijja when the pilgrims leave Mina after performing all the ceremonies of Hajj at 'Arafat, Al-Muzdalifa and Mina.",
        "arabic": "يوم النفر"
    },
    "Dhat-un-Nitaqain": {
        "definition": "Asma', the daughter of Abu Bakr. It literally means a woman with two belts. She was named so by the Prophet.",
        "arabic": "ذات النطاقين"
    },
    "Dhaw-ul-Arham": {
        "definition": "Kindred of blood.",
        "arabic": "ذوي الأرحام"
    },
    "Dhu-Mahram": {
        "definition": "A male, whom a woman can never marry because of close relationship (e.g. a brother, a father, an uncle etc.); or her own husband.",
        "arabic": "ذو محرم"
    },
    "Dhu-Tuwa": {
        "definition": "A well-known well in Makka. In the lifetime of the Prophet, Makka was a small city and this well was outside its precincts. Nowadays, Makka is a larger city, and the well is within its boundaries.",
        "arabic": "ذو طوى"
    },
    "Dhimmi": {
        "definition": "A non-Muslim living under the protection of an Islamic government.",
        "arabic": "ذمي"
    },
    "Dhul-Hijja": {
        "definition": "The twelfth month in the Islamic calendar.",
        "arabic": "ذو الحجة"
    },
    "Dhul-Hulaifa": {
        "definition": "The Miqat of the people of Al-Madina now called 'Abyar 'Ali.",
        "arabic": "ذو الحليفة"
    },
    "Dhul-Khalasa": {
        "definition": "Al-Ka'ba Al-Yamaniya, a house in Yemen where idols used to be worshipped. It belonged to the tribe of Khath'am and Bajaila.",
        "arabic": "ذو الخلصة"
    },
    "Dhul-Qa'da": {
        "definition": "The eleventh month of the Islamic calendar.",
        "arabic": "ذو القعدة"
    },
    "Dhul Qarnain": {
        "definition": "A great ruler in the past who ruled all over the world, and was a true believer. His story is mentioned in the Qur'an.",
        "arabic": "ذو القرنين"
    },
    "Dibaj": {
        "definition": "Pure silk cloth.",
        "arabic": "ديباج"
    },
    "Dinar": {
        "definition": "An ancient gold coin.",
        "arabic": "دينار"
    },
    "Dirham": {
        "definition": "A silver coin weighing 50 grains of barley with cut ends.",
        "arabic": "درهم"
    },
    "Diya (Diyat plural)": {
        "definition": "Blood-money (for wounds, killing etc.), compensation paid by the killer to the relatives of the victim (in unintentional cases).",
        "arabic": "دية"
    },
    "Duha": {
        "definition": "Forenoon.",
        "arabic": "الضحى"
    },
    "'Eid-al-Adha": {
        "definition": "The four-day festival of Muslims starting on the tenth day of Dhul-Hijja.",
        "arabic": "عيد الأضحى"
    },
    "'Eid-al-Fitr": {
        "definition": "The three-day festival of Muslims starting from the first day of Shawwal, the month that follows Ramadan immediately.",
        "arabic": "عيد الفطر"
    },
    "Fadak": {
        "definition": "A town near Al-Madina.",
        "arabic": "فدك"
    },
    "Fahish": {
        "definition": "One who talks evil.",
        "arabic": "فاحش"
    },
    "Fai'": {
        "definition": "War booty gained without fighting.",
        "arabic": "فيء"
    },
    "Fajr": {
        "definition": "Dawn or early morning before sunrise, or morning prayer.",
        "arabic": "الفجر"
    },
    "Faqih": {
        "definition": "A learned man who can give religious verdicts.",
        "arabic": "فقيه"
    },
    "Fara'id": {
        "definition": "Share fixed for the relatives of a deceased. Such shares are prescribed in the Qur'an.",
        "arabic": "الفرائض"
    },
    "Faraq": {
        "definition": "A bowl for measuring.",
        "arabic": "فرق"
    },
    "Farida": {
        "definition": "Plural: Fara'id. An enjoined duty.",
        "arabic": "فريضة"
    },
    "Farruj": {
        "definition": "A Qaba' opened at the back.",
        "arabic": "فرج"
    },
    "Farsakh": {
        "definition": "A distance of three miles: 1 mile = 6000 Dora = 1760 yards.",
        "arabic": "فرسخ"
    },
    "Fatah": {
        "definition": "A female slave or a young lady.",
        "arabic": "فتاة"
    },
    "Fidya": {
        "definition": "Compensation for a missed or wrongly practised religious ceremony, usually in the form of money or foodstuff or offering (animal).",
        "arabic": "فدية"
    },
    "Gharar": {
        "definition": "The sale of what is not present, e.g., of unfished fish.",
        "arabic": "غرر"
    },
    "Ghazi": {
        "definition": "A Muslim warrior returning after participation in Jihad (Islamic holy war).",
        "arabic": "غازي"
    },
    "Ghazwa": {
        "definition": "Plural: Ghazawat. A holy fighting in the cause of Allah consisting of a large army unit with the Prophet himself leading the army.",
        "arabic": "غزوة"
    },
    "Ghira": {
        "definition": "This word covers a wide meaning: jealousy as regards women, and also it is a feeling of great fury and anger when one's honour and prestige are injured or challenged.",
        "arabic": "غيرة"
    },
    "Ghulul": {
        "definition": "Stealing from the war booty before its distribution.",
        "arabic": "غلول"
    },
    "Ghuraf": {
        "definition": "Special abodes.",
        "arabic": "غرف"
    },
    "Ghusl": {
        "definition": "Taking a bath in a ceremonial way. This is necessary for one who is Junub and also on other occasions.",
        "arabic": "غسل"
    },
    "Hadath (Small)": {
        "definition": "Passing wind or urine or answering the call of nature.",
        "arabic": "حدث صغير"
    },
    "Hadath (Big)": {
        "definition": "Sexual discharge.",
        "arabic": "حدث كبير"
    },
    "Hady": {
        "definition": "An animal (a camel, a cow, a sheep or a goat) offered as a sacrifice by the pilgrims.",
        "arabic": "هدي"
    },
    "Hadith": {
        "definition": "The statements of the Prophet; i.e., his sayings, deeds, and approvals, etc.",
        "arabic": "حديث"
    },
    "Hais": {
        "definition": "A dish made of cooking-butter, dates, and cheese.",
        "arabic": "هيس"
    },
    "Hajj": {
        "definition": "Pilgrimage to Makka.",
        "arabic": "الحج"
    },
    "Al-Hajj-al-Akbar": {
        "definition": "The day of Nahr, i.e., the 10th of Dhul-Hijja.",
        "arabic": "الحج الأكبر"
    },
    "Hajj-al-Asghar": {
        "definition": "'Umra.",
        "arabic": "الحج الأصغر"
    },
    "Hajjat-ul-Wada'": {
        "definition": "The last Hajj of the Prophet, the year before he died.",
        "arabic": "حجة الوداع"
    },
    "Hajj Mabrur": {
        "definition": "Hajj accepted by Allah for being perfectly performed according to the Prophet's Sunna and with legally earned money.",
        "arabic": "حج مبرور"
    },
    "Hajj At-Tamattu' and Al-Qiran": {
        "definition": "Hajj performed with 'Umra preceding it.",
        "arabic": "حج التمتع والقران"
    },
    "Hajjam": {
        "definition": "One who performs cupping.",
        "arabic": "حجام"
    },
    "Halal": {
        "definition": "Lawful.",
        "arabic": "حلال"
    },
    "Hanata": {
        "definition": "An expression used when you don't want to call somebody by her name. It is used for calling a female.",
        "arabic": "حناتا"
    },
    "Hanif": {
        "definition": "Pure Islamic Monotheism, worshipping Allah Alone and nothing else.",
        "arabic": "حنيف"
    },
    "Haram": {
        "definition": "Unlawful, forbidden, and punishable from the viewpoint of religion.",
        "arabic": "حرام"
    },
    "Haram (Sanctuaries)": {
        "definition": "Sanctuaries of Makka and Al-Madina.",
        "arabic": "الحرم"
    },
    "Haraura": {
        "definition": "A town in Iraq.",
        "arabic": "حروراء"
    },
    "Harba": {
        "definition": "A short spear.",
        "arabic": "حربة"
    },
    "Harj": {
        "definition": "Killing.",
        "arabic": "هرج"
    },
    "Harra": {
        "definition": "A well-known rocky place in Al-Madina covered with black stones.",
        "arabic": "حرة"
    },
    "Hasir": {
        "definition": "A mat made of leaves of date-palms and is as long as (or longer than) a man's stature.",
        "arabic": "حصير"
    },
    "Haya'": {
        "definition": "This term covers a large number of concepts. It may mean 'modesty', 'self-respect', 'bashfulness', 'honour', etc. Haya' is of two kinds: good and bad.",
        "arabic": "حياء"
    },
    "Hawala": {
        "definition": "The transference of a debt from one person to another.",
        "arabic": "حوالة"
    },
    "Hawazin": {
        "definition": "A tribe of Quraish.",
        "arabic": "هوازن"
    },
    "Henna": {
        "definition": "A kind of plant used for dyeing hair, etc.",
        "arabic": "حناء"
    },
    "Hilab": {
        "definition": "A kind of scent.",
        "arabic": "حلاب"
    },
    "Hima": {
        "definition": "A private pasture.",
        "arabic": "حمى"
    },
    "Himyan": {
        "definition": "A kind of belt, part of which serves as a purse to keep money in it.",
        "arabic": "حميان"
    },
    "Hiqqa": {
        "definition": "A three-year-old she-camel.",
        "arabic": "حقه"
    },
    "Hira'": {
        "definition": "A well-known cave in a mountain near Makka.",
        "arabic": "غار حراء"
    },
    "Houris": {
        "definition": "Very fair females created by Allah as such, not from the offspring of Adam, with intense black irises of their eyes and intense white scleras.",
        "arabic": "الحور العين"
    },
    "Hubal": {
        "definition": "The name of an idol in the Ka'ba in the Pre-Islamic Period of Ignorance.",
        "arabic": "هبل"
    },
    "Hubla": {
        "definition": "A kind of desert tree.",
        "arabic": "حبلة"
    },
    "Huda": {
        "definition": "Chanting of camel-drivers keeping time of camel's walk.",
        "arabic": "حداء"
    },
    "Hudud": {
        "definition": "Allah's boundary limits for Halal (lawful) and Haram (unlawful).",
        "arabic": "حدود"
    },
    "Hujra": {
        "definition": "Courtyard of a dwelling place, or a room.",
        "arabic": "حجرة"
    },
    "Hukm": {
        "definition": "A judgment of legal decision, especially of Allah.",
        "arabic": "حكم"
    },
    "Hums": {
        "definition": "The tribe of Quraish, their offspring, and their allies were called Hums. This word implies enthusiasm and strictness.",
        "arabic": "حمس"
    },
    "Hunain": {
        "definition": "A valley between Makka and Ta'if where the battle took place between the Prophet and Quraish pagans.",
        "arabic": "حنين"
    },
    "Hanut": {
        "definition": "A kind of scent used for embalming the dead.",
        "arabic": "حنوط"
    },
    "'Iddah": {
        "definition": "Allah's prescribed period for divorce and marriage, etc.",
        "arabic": "عدة"
    },
    "Iftar": {
        "definition": "The opposite of fasting, breaking the fast.",
        "arabic": "إفطار"
    },
    "Ihram": {
        "definition": "A state in which one is prohibited from practicing certain deeds that are lawful at other times.",
        "arabic": "إحرام"
    },
    "Ihsan": {
        "definition": "The highest level of deeds and worship, perfection in worship.",
        "arabic": "إحسان"
    },
    "Ila'": {
        "definition": "The oath taken by a husband that he would not approach his wife for a certain period.",
        "arabic": "إيلاء"
    },
    "Iliya": {
        "definition": "Jerusalem.",
        "arabic": "إيليا"
    },
    "Imam": {
        "definition": "The person who leads others in the prayer or the Muslim Caliph (or ruler).",
        "arabic": "إمام"
    },
    "Iman": {
        "definition": "Faith, Belief.",
        "arabic": "إيمان"
    },
    "Imlas": {
        "definition": "An abortion caused by being beaten over one's (a pregnant wife's) abdomen.",
        "arabic": "إملاء"
    },
    "Inbijaniya": {
        "definition": "A woolen garment without marks.",
        "arabic": "إنبجانية"
    },
    "Iqama": {
        "definition": "The statements of the Adhan are recited reduced so that the statements that are expressed twice in the Adhan are recited once in Iqama except the last utterance of 'Allahu-Akbar,' The prayer is offered immediately after Iqama has been pronounced.",
        "arabic": "إقامة"
    },
    "Iqamat-as-Salat": {
        "definition": "The offering of the prayers perfectly.",
        "arabic": "إقامة الصلاة"
    },
    "'Isha'": {
        "definition": "Late evening prayer. Its time starts about one and a half hours after sunset, till the middle of night.",
        "arabic": "العشاء"
    },
    "Ishtimal-as-Samma": {
        "definition": "The wearing of clothes in the following two ways: To cover one shoulder with a garment and leave the other bare, or to wrap oneself in a garment while sitting in such a way that nothing of that garment would cover one's private parts.",
        "arabic": "اشتمال الصماء"
    },
    "Istabraq": {
        "definition": "Thick Dibaj (pure silk cloth).",
        "arabic": "إستبرق"
    },
    "Istihada": {
        "definition": "Bleeding from the womb of a woman in between her ordinary periods.",
        "arabic": "إستحاضة"
    },
    "Istihsan": {
        "definition": "To give a verdict with a proof from one's heart with satisfaction, and one cannot express it.",
        "arabic": "إستحسان"
    },
    "Istikhara": {
        "definition": "A prayer consisting of two Rakat in which the praying person appeals to Allah to guide him on the right way, regarding a certain deed or situation.",
        "arabic": "إستخارة"
    },
    "Istisqa'": {
        "definition": "A prayer consisting of two Rakat, invoking Allah for rain in seasons of drought.",
        "arabic": "إستسقاء"
    },
    "I'tikaf": {
        "definition": "Seclusion in a mosque for the purpose of worshipping Allah only.",
        "arabic": "إعتكاف"
    },
    "Izar": {
        "definition": "A sheet worn below the waist to cover the lower half of the body.",
        "arabic": "إزار"
    },
    "Jadha'a": {
        "definition": "A four-year-old she-camel.",
        "arabic": "جذعة"
    },
    "Jalil": {
        "definition": "A kind of good smelling grass grown in Makka.",
        "arabic": "جليل"
    },
    "Jam'": {
        "definition": "Al-Muzdalifa, a well-known place near Makka.",
        "arabic": "جمع"
    },
    "Jamra": {
        "definition": "A small stone-built pillar in a walled place. There are three Jamras situated at Mina.",
        "arabic": "جمرة"
    },
    "Jamrat-al-'Aqaba": {
        "definition": "One of the three stone-built pillars situated at Mina. It is situated at the entrance of Mina from the direction of Makka.",
        "arabic": "جمرة العقبة"
    },
    "Janaba": {
        "definition": "The state of a person after having sexual intercourse with his wife or after having a sexual discharge in a wet dream.",
        "arabic": "جنابة"
    },
    "Janib": {
        "definition": "A good kind of date.",
        "arabic": "جانب"
    },
    "Jihad": {
        "definition": "Holy fighting in the Cause of Allah or any other kind of effort to make Allah's Word (Islam) superior.",
        "arabic": "جهاد"
    },
    "Jimar": {
        "definition": "Plural of Jamra.",
        "arabic": "جمار"
    },
    "Jinn": {
        "definition": "A creation, created by Allah from fire, like human beings from mud, and angels from light.",
        "arabic": "جن"
    },
    "Jizya": {
        "definition": "Head tax imposed by Islam on all non-Muslims living under the protection of an Islamic government.",
        "arabic": "جزية"
    },
    "Jubba": {
        "definition": "A cloak.",
        "arabic": "جبة"
    },
    "Jumada-ath-Thaniya": {
        "definition": "Sixth month of the Islamic calendar.",
        "arabic": "جمادى الثانية"
    },
    "Jumu'a": {
        "definition": "Friday.",
        "arabic": "جمعة"
    },
    "Junub": {
        "definition": "A person who is in a state of Janaba.",
        "arabic": "جنب"
    },
    "Jurhum": {
        "definition": "Name of an Arab tribe.",
        "arabic": "جرهم"
    },
    "Ka'ba": {
        "definition": "A square stone building in Al-Masjid-al-Haram (the great mosque at Makka) towards which all Muslims turn their faces in prayer.",
        "arabic": "الكعبة"
    },
    "Kafala": {
        "definition": "The pledge given by somebody to a creditor to guarantee that the debtor will be present at a certain specific place to pay his debt or fine, or to undergo a punishment, etc.",
        "arabic": "كفالة"
    },
    "Kafir": {
        "definition": "The one who disbelieves in Allah, His Messengers, all the angels, all the holy Books, Day of Resurrection, and in the Al-Qadar (Divine Preordainments).",
        "arabic": "كافر"
    },
    "Kanz": {
        "definition": "Hoarded up gold, silver, and money, the Zakat of which has not been paid.",
        "arabic": "كنز"
    },
    "Kasafat": {
        "definition": "An Arabic verb meaning 'eclipsed', used for a solar eclipse.",
        "arabic": "كسفت"
    },
    "Katm": {
        "definition": "A plant used for dyeing hair.",
        "arabic": "كتم"
    },
    "Kauthar": {
        "definition": "A river in Paradise.",
        "arabic": "الكوثر"
    },
    "Khadira": {
        "definition": "A kind of vegetation.",
        "arabic": "خضيرة"
    },
    "Khaibar": {
        "definition": "A well-known town in the north of Al-Madina.",
        "arabic": "خيبر"
    },
    "Khalil": {
        "definition": "The one whose love is mixed with one's heart and it is superior to a friend or beloved.",
        "arabic": "خليل"
    },
    "Khaluq": {
        "definition": "A kind of perfume.",
        "arabic": "خلوق"
    },
    "Khamisa": {
        "definition": "A black woollen square blanket with marks on it.",
        "arabic": "خميسة"
    },
    "Kharaj": {
        "definition": "Zakat imposed on the yield of the land (1/10th or 1/20th).",
        "arabic": "خراج"
    },
    "Khasafa": {
        "definition": "An Arabic word meaning 'eclipsed', used for lunar eclipse.",
        "arabic": "خسفت"
    },
    "Khawarij": {
        "definition": "The people who dissented from the religion and disagreed with the rest of the Muslims.",
        "arabic": "الخوارج"
    },
    "Khazir": {
        "definition": "A special type of dish prepared from barley-flour and meat-soup.",
        "arabic": "خزير"
    },
    "Khazira": {
        "definition": "A special dish prepared from white flour, fat, etc.",
        "arabic": "خزيرة"
    },
    "Khuff": {
        "definition": "Leather socks.",
        "arabic": "خف"
    },
    "Khul'": {
        "definition": "A kind of divorce where the wife parts from her husband by giving him a certain compensation or to return back the Mahr which he gave her.",
        "arabic": "خلع"
    },
    "Khumra": {
        "definition": "A small mat just sufficient for the face and the hands during prostration.",
        "arabic": "خمرة"
    },
    "Khums": {
        "definition": "One-fifth of war booty given in Allah's Cause.",
        "arabic": "خمس"
    },
    "Khutba": {
        "definition": "Sermon (religious talk).",
        "arabic": "خطبة"
    },
    "Khutba of Nikah": {
        "definition": "A speech delivered at the time of concluding the marriage contract.",
        "arabic": "خطبة النكاح"
    },
    "Kuhl": {
        "definition": "Antimony eye powder.",
        "arabic": "كحل"
    },
    "Kufa": {
        "definition": "A town in Iraq.",
        "arabic": "الكوفة"
    },
    "Kufr": {
        "definition": "It is basically disbelief in any of the articles of Islamic Faith: to believe in Allah (God), His angels, His Messengers, His revealed Books, the Day of Resurrection, and Al-Qadar (Divine Preordainments).",
        "arabic": "كفر"
    },
    "Kuniya": {
        "definition": "Calling a man, O 'father of so-and-so!' Or calling a woman, O'mother of so-and-so!' This is a custom of the Arabs.",
        "arabic": "كنية"
    },
    "Kusuf": {
        "definition": "Solar eclipse.",
        "arabic": "كسوف"
    },
    "La Ilaha ill Allah": {
        "definition": "None has the right to be worshipped but Allah.",
        "arabic": "لا إله إلا الله"
    },
    "Labbaika wa Sa'daika": {
        "definition": "I respond to Your Call; I am obedient to Your Orders.",
        "arabic": "لبيك وسعديك"
    },
    "Li'an": {
        "definition": "An oath taken by both the wife and the husband when he accuses his wife of committing illegal sexual intercourse.",
        "arabic": "لعان"
    },
    "Luqata": {
        "definition": "Article or a thing (a pouch or a purse tied with a string) found by somebody other than the owner who has lost it.",
        "arabic": "لقطة"
    },
    "Mabrur (Hajj)": {
        "definition": "Accepted by Allah for being perfectly performed according to the Prophet's legal ways and with legally earned money.",
        "arabic": "مبرور"
    },
    "Maghafir": {
        "definition": "A bad smelling gum.",
        "arabic": "مغافير"
    },
    "Maghrib": {
        "definition": "Sunset, evening prayer.",
        "arabic": "المغرب"
    },
    "Mahram": {
        "definition": "See Dhu-Mahram.",
        "arabic": "محرم"
    },
    "Mahr": {
        "definition": "Bridal-money given by the husband to the wife at the time of marriage.",
        "arabic": "مهر"
    },
    "Makruh": {
        "definition": "Not approved of, undesirable from the point of view of religion, although not punishable.",
        "arabic": "مكروه"
    },
    "Mamluk": {
        "definition": "A male slave.",
        "arabic": "مملوك"
    },
    "Manasik": {
        "definition": "Ceremonial acts of Hajj and 'Umra including Ihram, Tawaf of the Ka'ba and Sa'y of As-Safa and Al-Marwa, stay at 'Arafat, Muzdalifa, Mina, Ramy of Jamrats, and slaughtering of Hady (animal).",
        "arabic": "مناسك"
    },
    "Maniha (plural Mana'ih)": {
        "definition": "A sort of gift in the form of a she-camel or a sheep given temporarily to somebody so that its milk may be used, and then the animal is returned to its owner.",
        "arabic": "منيحة"
    },
    "Maqam Ibrahim": {
        "definition": "The stone on which Abraham stood while he and Ishmael were building the Ka'ba.",
        "arabic": "مقام إبراهيم"
    },
    "Al-Maqam-al-Mahmud": {
        "definition": "The highest place in Paradise, which will be granted to Prophet Muhammad and none else.",
        "arabic": "المقام المحمود"
    },
    "Mar'as": {
        "definition": "A place nearer to Mina than Ash-Shajara.",
        "arabic": "مرعس"
    },
    "Al-Marwa": {
        "definition": "A mountain in Makka, neighboring the great mosque (i.e., Al-Masjid-al-Haram).",
        "arabic": "المروة"
    },
    "Masha' Allah": {
        "definition": "An Arabic phrase meaning 'What Allah wills,' and it indicates a good omen.",
        "arabic": "ما شاء الله"
    },
    "Masjid": {
        "definition": "Mosque.",
        "arabic": "مسجد"
    },
    "Mashruba": {
        "definition": "Attic room.",
        "arabic": "مشربة"
    },
    "Mathani": {
        "definition": "Oft repeated Verses of the Qur'an, particularly Surat Al-Fatiha, recited repeatedly in prayer.",
        "arabic": "مثاني"
    },
    "Maula": {
        "definition": "It has many meanings, including a manumitted slave, a master, or the Lord (Allah).",
        "arabic": "مولى"
    },
    "Maulaya": {
        "definition": "My lord, my master (an expression used when a slave addresses his master, also used for a freed slave).",
        "arabic": "مولاي"
    },
    "Mayathir": {
        "definition": "Silk cushions.",
        "arabic": "مياثر"
    },
    "Mijanna": {
        "definition": "A place at Makka.",
        "arabic": "مجنة"
    },
    "Mina": {
        "definition": "A place outside Makka on the road to 'Arafat. It is five miles away from Makka and about 10 miles from 'Arafat.",
        "arabic": "منى"
    },
    "Miqat (plural Mawaqit)": {
        "definition": "One of the several places specified by the Prophet for people to assume Ihram at, on their way to Makka, when intending to perform Hajj or 'Umra.",
        "arabic": "ميقات"
    },
    "Miracles": {
        "definition": "Of the Prophet. See Sahih Al-Bukhari, Vol 1, 'Introduction'.",
        "arabic": "معجزات"
    },
    "Mi'raj": {
        "definition": "The ascent of the Prophet to the heavens.",
        "arabic": "معراج"
    },
    "Mirbad": {
        "definition": "A place where dates are dried.",
        "arabic": "مربد"
    },
    "Misr": {
        "definition": "Egypt.",
        "arabic": "مصر"
    },
    "Miswak": {
        "definition": "A toothbrush made of Arak-tree roots.",
        "arabic": "مسواك"
    },
    "Mithqal": {
        "definition": "A special kind of weight (equals 4 2/7 grams approx., used for weighing gold).",
        "arabic": "مثقال"
    },
    "Muhkam": {
        "definition": "Qur'anic Verses the orders of which are not canceled (abrogated).",
        "arabic": "محكم"
    },
    "Mu'adh-dhin": {
        "definition": "A call-maker who pronounces the Adhan loudly, calling people to come and perform the prayer.",
        "arabic": "مؤذن"
    },
    "Mu'awwidhat": {
        "definition": "Surat Al-Falaq (113) and Surat An-Nas (114) of the Qur'an.",
        "arabic": "معوذات"
    },
    "Mubashshirat": {
        "definition": "Glad tidings.",
        "arabic": "مبشرات"
    },
    "Mubiqat": {
        "definition": "Great destructive sins.",
        "arabic": "موبقات"
    },
    "Mudabbar": {
        "definition": "A slave who is promised by his master to be manumitted after the latter's death.",
        "arabic": "مدبر"
    },
    "Mudd": {
        "definition": "A measure of two-thirds of a kilogram (approx.).",
        "arabic": "مد"
    },
    "Mufassal or Mufassalat": {
        "definition": "The Surahs starting from 'Qaf to the end of the Qur'an (i.e., from No. 50 to the end of the Qur'an 114).",
        "arabic": "مفصل"
    },
    "Muhajir": {
        "definition": "Anyone of the early Muslims who had migrated from any place to Al-Madina in the life-time of the Prophet before the conquest of Makka.",
        "arabic": "مهاجر"
    },
    "Muhrim": {
        "definition": "One who assumes the state of Ihram for the purpose of performing the Hajj or 'Umra.",
        "arabic": "محرم"
    },
    "Muhrima": {
        "definition": "A female in the state of Ihram.",
        "arabic": "محرمة"
    },
    "Muhsar": {
        "definition": "A Muhrim who intends to perform the Hajj or 'Umra but cannot because of some obstacle.",
        "arabic": "محصر"
    },
    "Mujahid": {
        "definition": "A Muslim warrior in Jihad.",
        "arabic": "مجاهد"
    },
    "Mujazziz": {
        "definition": "A Qa'if: a learned man who reads the foot and hand marks.",
        "arabic": "مجزز"
    },
    "Mujtahidun": {
        "definition": "Independent religious scholars who do not follow religious opinions except with proof from the Qur'an and the Prophet's Sunna.",
        "arabic": "مجتهدون"
    },
    "Mukatab": {
        "definition": "A slave (male or female) who binds himself or herself to pay a certain ransom for his or her freedom.",
        "arabic": "مكاتب"
    },
    "Mula'ana": {
        "definition": "The act of performing Li'an.",
        "arabic": "ملاعنة"
    },
    "Mulhidun": {
        "definition": "Heretical.",
        "arabic": "ملحدون"
    },
    "Muqaiyar": {
        "definition": "A name of a pot in which alcoholic drinks used to be prepared.",
        "arabic": "مقيار"
    },
    "Musalla": {
        "definition": "A praying place.",
        "arabic": "مصلى"
    },
    "Mushrikun": {
        "definition": "Polytheists, pagans, idolaters, and disbelievers in the Oneness of Allah and His Messenger Muhammad.",
        "arabic": "مشركون"
    },
    "Mustahada": {
        "definition": "A woman who has bleeding from the womb in between her ordinary periods.",
        "arabic": "مستحاضة"
    },
    "Mutafahhish": {
        "definition": "A person who conveys evil talk.",
        "arabic": "متفحش"
    },
    "Mu'takif": {
        "definition": "One who is in a state of I'tikaf.",
        "arabic": "معتكف"
    },
    "Mutashabihat": {
        "definition": "Qur'anic Verses which are not clear and are difficult to understand.",
        "arabic": "متشابهات"
    },
    "Mutras": {
        "definition": "A Persian word meaning 'don't be afraid.'",
        "arabic": "متراس"
    },
    "Muttaqun": {
        "definition": "Pious and righteous persons who fear Allah much and love Allah much.",
        "arabic": "متقون"
    },
    "Muzabana": {
        "definition": "The sale of fresh dates for dried dates by measure, and the sale of fresh grapes for dried grapes by measure.",
        "arabic": "مزابنة"
    },
    "Muzaffat": {
        "definition": "A name of a pot in which alcoholic drinks used to be prepared.",
        "arabic": "مزفت"
    },
    "Muzdalifa": {
        "definition": "A place between 'Arafat and Mina where the pilgrims, while returning from 'Arafat, have to stop and stay for the whole night or greater part of it, between the ninth and tenth of Dhul-Hijja.",
        "arabic": "مزدلفة"
    },
    "Muharram": {
        "definition": "The first month of the Islamic calendar.",
        "arabic": "محرم"
    },
    "Nabidh": {
        "definition": "Water in which dates or grapes etc. are soaked and is not yet fermented.",
        "arabic": "نبيذ"
    },
    "Nafr (day of)": {
        "definition": "The 12th and 13th of Dhul-Hijja when the pilgrims leave Mina after performing all the ceremonies of Hajj.",
        "arabic": "يوم النفر"
    },
    "Nahd": {
        "definition": "Sharing the expenses of a journey or putting the journey food of the travelers together to be distributed among them in equal shares.",
        "arabic": "نهض"
    },
    "Nahr": {
        "definition": "Literal: slaughtering of the camels only and is done by cutting the carotid artery at the root of the neck; the day of Nahr is the tenth of Dhul-Hijja on which pilgrims slaughter their sacrifices.",
        "arabic": "نحر"
    },
    "Nadiha": {
        "definition": "A camel used for agricultural purposes.",
        "arabic": "ناضحة"
    },
    "Nady": {
        "definition": "A part of an arrow.",
        "arabic": "نضي"
    },
    "Namima": {
        "definition": "Calumnies, conveyance of disagreeable false information from one person to another to create hostility between them.",
        "arabic": "نميمة"
    },
    "Naqib (s)": {
        "definition": "A person heading a group of six persons in an expedition, tribal chiefs.",
        "arabic": "نقيب"
    },
    "Naqir": {
        "definition": "A name of a pot in which alcoholic drinks used to be prepared.",
        "arabic": "نقير"
    },
    "Nasl": {
        "definition": "A part of an arrow.",
        "arabic": "نصل"
    },
    "Nawafil": {
        "definition": "Plural of Nafila, optional practice of worship in contrast to obligatory (Farida).",
        "arabic": "نوافل"
    },
    "Nikah": {
        "definition": "Marriage (wedlock) according to Islamic law.",
        "arabic": "نكاح"
    },
    "Nisab": {
        "definition": "Minimum amount of property liable to payment of the Zakat, e.g., Nisab of gold is twenty (20) Mithqal, i.e., approx. 94 grams; Nisab of silver is two hundred (200) Dirhams, i.e., approx. 640 grams.",
        "arabic": "نصاب"
    },
    "Nun": {
        "definition": "Fish.",
        "arabic": "نون"
    },
    "Nusk": {
        "definition": "Religious act of worship.",
        "arabic": "نسك"
    },
    "Nusub": {
        "definition": "Singular of Ansab. An-Nusub were stone altars at fixed places or graves whereon sacrifices were slaughtered during fixed periods of occasions and seasons in the name of idols, jinns, angels, pious men, saints, etc.",
        "arabic": "نصب"
    },
    "Nusuk": {
        "definition": "A sacrifice.",
        "arabic": "نسك"
    },
    "Prophet": {
        "definition": "A person who is inspired divinely.",
        "arabic": "نبي"
    },
    "Qaba'": {
        "definition": "An outer garment with full-length sleeves.",
        "arabic": "قباء"
    },
    "Qadar": {
        "definition": "Divine Pre-Ordainment.",
        "arabic": "قدر"
    },
    "Lailat-ul-Qadr": {
        "definition": "One of the odd last ten nights of the month of fasting (i.e., Ramadan), Allah describes it as better than one thousand months.",
        "arabic": "ليلة القدر"
    },
    "Qalib": {
        "definition": "A well.",
        "arabic": "قليب"
    },
    "Qari'": {
        "definition": "Early Muslim religious scholar was called Qurra'. This word is also used for a person who knows the Qur'an by heart.",
        "arabic": "قارئ"
    },
    "Qarin": {
        "definition": "One who performs Hajj-al-Qiran.",
        "arabic": "قارِن"
    },
    "Qarn-al-Manazil": {
        "definition": "The Miqat of the people of Najd.",
        "arabic": "قرن المنازل"
    },
    "Qasab": {
        "definition": "Pipes made of gold, pearls, and other precious stones.",
        "arabic": "قصب"
    },
    "Qatifa": {
        "definition": "Thick soft cloth.",
        "arabic": "قطيفة"
    },
    "Qattat": {
        "definition": "A person who conveys information from someone to another with the intention of causing harm and enmity between them.",
        "arabic": "قتات"
    },
    "Qiblah": {
        "definition": "The direction in which all Muslims turn their faces in prayers and that direction is towards the Ka'ba in Makka.",
        "arabic": "قبلة"
    },
    "Qil and Qal": {
        "definition": "Sinful, useless talk (e.g., backbiting, lies, etc.).",
        "arabic": "قال وقيل"
    },
    "Qintar": {
        "definition": "A weight-measure for food-grains, etc., e.g., wheat, maize, oat, barley.",
        "arabic": "قنطار"
    },
    "Qiram": {
        "definition": "A thin marked woolen curtain.",
        "arabic": "قرام"
    },
    "Qirat": {
        "definition": "A special weight; sometimes a very great weight like Uhud mountain. 1 Qirat = 1/2 Daniq & 1 Daniq = 1/6 Dirham.",
        "arabic": "قيراط"
    },
    "Qissi": {
        "definition": "A kind of cloth containing silk; some say it is called so because it is manufactured in Egypt at a place called Qiss.",
        "arabic": "قِسِّي"
    },
    "Qitham": {
        "definition": "A plant disease that causes fruit to fall before ripening.",
        "arabic": "قثم"
    },
    "Qiyam": {
        "definition": "The standing posture in prayer.",
        "arabic": "قيام"
    },
    "Qiyas": {
        "definition": "Verdicts and judgments given by the Islamic religious scholars based on analogy.",
        "arabic": "قياس"
    },
    "Quba'": {
        "definition": "A place on the outskirts of Al-Madina. The Prophet established a mosque there.",
        "arabic": "قباء"
    },
    "Qudhadh": {
        "definition": "A part of an arrow.",
        "arabic": "قذاذ"
    },
    "Qumqum": {
        "definition": "A narrow-headed vessel.",
        "arabic": "قمقم"
    },
    "Qunut": {
        "definition": "Invocation in the prayer.",
        "arabic": "قنوت"
    },
    "Quraish": {
        "definition": "One of the greatest tribes in Arabia in the Pre-Islamic Period of Ignorance. The Prophet Muhammad belonged to this tribe.",
        "arabic": "قريش"
    },
    "Quraishi": {
        "definition": "A person belonging to the Quraish tribe.",
        "arabic": "قريشي"
    },
    "Rabb": {
        "definition": "Lord, Owner (it is also one of the Names of Allah).",
        "arabic": "رب"
    },
    "Rabbuk": {
        "definition": "Your Lord, Your Master.",
        "arabic": "ربك"
    },
    "Rabi'-ul-Awwal": {
        "definition": "Third month of the Islamic calendar.",
        "arabic": "ربيع الأول"
    },
    "Rahila": {
        "definition": "A she-camel used for riding.",
        "arabic": "راحلة"
    },
    "Raiyan": {
        "definition": "The name of one of the gates of Paradise through which the people who often observe fasting will enter.",
        "arabic": "الريان"
    },
    "Rajab": {
        "definition": "The seventh month of the Islamic calendar.",
        "arabic": "رجب"
    },
    "Rajaz": {
        "definition": "Name of poetic meter.",
        "arabic": "رجز"
    },
    "Rak'a": {
        "definition": "The prayer of Muslims consists of Rak'at (singular-Rak'a), which consists of one standing, one bowing, and two prostrations.",
        "arabic": "ركعة"
    },
    "Ramadan": {
        "definition": "The month of fasting. It is the ninth month of the Islamic calendar.",
        "arabic": "رمضان"
    },
    "Ramal": {
        "definition": "Fast walking accompanied by the movements of the arms and legs to show one's physical strength during the Tawaf around the Ka'ba.",
        "arabic": "رمل"
    },
    "Ramy": {
        "definition": "The throwing of pebbles at the Jimar at Mina.",
        "arabic": "رمي"
    },
    "Riba' (Usury)": {
        "definition": "Usury which is of two major kinds: (a) Riba' Nasi'a, i.e., interest on lent money; (b) Riba' Fadl, i.e., taking a superior thing of the same kind of goods by giving more of the same kind of goods of inferior quality.",
        "arabic": "ربا"
    },
    "Rida'": {
        "definition": "A piece of cloth worn around the upper part of the body.",
        "arabic": "رداء"
    },
    "Rikaz": {
        "definition": "Buried wealth (from the pre-Islamic period).",
        "arabic": "ركاز"
    },
    "Ruh-ul-Lah": {
        "definition": "According to the early religious scholars, it means a soul created by Allah.",
        "arabic": "روح الله"
    },
    "Ruqba": {
        "definition": "A kind of gift in the form of a house given to somebody to live in as long as he is alive.",
        "arabic": "رقبة"
    },
    "Sa'": {
        "definition": "A measure that equals four Mudds (3 kg. approx).",
        "arabic": "صاع"
    },
    "Sab'a-al-Mathani": {
        "definition": "The seven repeatedly recited Verses, i.e., Surat Al-Fatiha.",
        "arabic": "سبع المثاني"
    },
    "Sabahah": {
        "definition": "An exclamation indicating an appeal for help.",
        "arabic": "سباحة"
    },
    "Sabi'un": {
        "definition": "A passed nation that lived in Iraq, said La Ilaha ill Allah, and used to read Az-Zabur (The Psalms of the Sabi'uns).",
        "arabic": "صابيئون"
    },
    "Sa'dan": {
        "definition": "A thorny plant suitable for grazing animals.",
        "arabic": "سعدان"
    },
    "Sadaqa": {
        "definition": "Anything given in charity.",
        "arabic": "صدقة"
    },
    "As-Safa and Al-Marwa": {
        "definition": "Two mountains at Makka neighboring Al-Masjid-Al-Haram (the great mosque).",
        "arabic": "الصفا والمروة"
    },
    "Sahba": {
        "definition": "A place near Khaibar.",
        "arabic": "صهباء"
    },
    "Sahw": {
        "definition": "Forgetting how many Rak'at a person has prayed in which case he should perform two prostrations of Sahw.",
        "arabic": "سهو"
    },
    "Sahur": {
        "definition": "A meal taken at night before the Fajr prayer by a fasting person.",
        "arabic": "سحور"
    },
    "Sa'y": {
        "definition": "The going for seven times between the mountains of As-Safa and Al-Marwa in Makka during the performance of Hajj and 'Umra.",
        "arabic": "سعي"
    },
    "Sayyid": {
        "definition": "Master (it is also used as a title name of the descendants of the Prophet).",
        "arabic": "سيد"
    },
    "Sayyidi": {
        "definition": "My master.",
        "arabic": "سيدي"
    },
    "Sakinah": {
        "definition": "Tranquility, calmness, peace, and reassurance.",
        "arabic": "سكينة"
    },
    "Salab": {
        "definition": "Belongings (arms, horse, etc.) of a deceased warrior killed in a battle.",
        "arabic": "سلب"
    },
    "Salaf": {
        "definition": "A sale in which the price is paid at once for goods to be delivered later.",
        "arabic": "سلف"
    },
    "Salam": {
        "definition": "Synonym of Salaf.",
        "arabic": "سلام"
    },
    "Sami' Allahu Liman Hamidah": {
        "definition": "Allah heard him who sent his praises to Him.",
        "arabic": "سمع الله لمن حمده"
    },
    "Samur": {
        "definition": "A kind of tree.",
        "arabic": "سمور"
    },
    "Sanah": {
        "definition": "Means 'good' in the Ethiopian language.",
        "arabic": "سنة"
    },
    "Sariya": {
        "definition": "A small army-unit sent by the Prophet for Jihad, without his participation in it.",
        "arabic": "سرية"
    },
    "Sarif": {
        "definition": "A place six miles away from Makka.",
        "arabic": "صريف"
    },
    "Sawiq": {
        "definition": "A kind of mash made of powdered roasted wheat or barley grain (also with sugar and dates).",
        "arabic": "سويق"
    },
    "Sha'ban": {
        "definition": "The eighth month of the Islamic calendar.",
        "arabic": "شعبان"
    },
    "Sham": {
        "definition": "The region comprising Syria, Palestine, Lebanon, and Jordan.",
        "arabic": "الشام"
    },
    "Shawwal": {
        "definition": "The tenth month of the Islamic calendar.",
        "arabic": "شوال"
    },
    "Shighar": {
        "definition": "A type of marriage in which persons exchange their daughters or sisters in marriage without Mahr.",
        "arabic": "شغار"
    },
    "Shirak": {
        "definition": "A leather strap.",
        "arabic": "شراك"
    },
    "Shirk": {
        "definition": "Polytheism and it is to worship others along with Allah.",
        "arabic": "شرك"
    },
    "Shuf'a": {
        "definition": "Pre-emption.",
        "arabic": "شفعة"
    },
    "Siddiq and Siddiqun": {
        "definition": "Those followers of the Prophets who were first and foremost to believe in them.",
        "arabic": "صديق"
    },
    "Sidr": {
        "definition": "Lote tree (or Nabk tree).",
        "arabic": "سدر"
    },
    "Sidrat-ul-Muntaha": {
        "definition": "A Nabk tree over the seventh heaven near the Paradise.",
        "arabic": "سدرة المنتهى"
    },
    "Siffin (battle of)": {
        "definition": "A battle that took place between 'Ali's followers and Mu'awiya's followers at the river of the Euphrates in 'Iraq.",
        "arabic": "صفين"
    },
    "Siwak": {
        "definition": "A piece of a root of a tree called Al-Arak, used as a toothbrush.",
        "arabic": "سواك"
    },
    "Subhan Allah": {
        "definition": "To honor Allah and make Him free from all that unsuitable evil things that are ascribed to Him.",
        "arabic": "سبحان الله"
    },
    "Suhuliya": {
        "definition": "A cotton cloth, its name is derived from the name of a village in Yemen called Suhul.",
        "arabic": "سهولية"
    },
    "Sundus": {
        "definition": "A kind of silk cloth.",
        "arabic": "سندس"
    },
    "Sunna (legal ways)": {
        "definition": "Literally means legal ways, orders, acts of worship, and statements of the Prophet, that have become models to be followed by the Muslims.",
        "arabic": "سنة"
    },
    "Sutra": {
        "definition": "An object like a pillar, wall, or stick, a spear, etc., the height of which should not be less than a foot and must be in front of a praying person to act as a symbolical barrier between him and the others.",
        "arabic": "سترة"
    },
    "Taba (Taiba)": {
        "definition": "Another name for Al-Madina.",
        "arabic": "طابة"
    },
    "Tabuk": {
        "definition": "A well-known town about 700 kilometers north of Al-Madina.",
        "arabic": "تبوك"
    },
    "Taghut": {
        "definition": "The word Taghut covers a wide range of meanings: anything worshipped other than the Real God (Allah).",
        "arabic": "طاغوت"
    },
    "Tahajjud": {
        "definition": "Night optional prayers offered at any time after Isha prayers and before the Fajr prayer.",
        "arabic": "تهجد"
    },
    "Tahnik": {
        "definition": "The Islamic customary process of chewing a piece of date, etc., and putting a part of its juice in the child's mouth and pronouncing Adhan in the child's ears.",
        "arabic": "تحنيك"
    },
    "Taiba": {
        "definition": "One of the names of Al-Madina city.",
        "arabic": "طيبة"
    },
    "Ta'if": {
        "definition": "A well-known town near Makka.",
        "arabic": "الطائف"
    },
    "Takbir": {
        "definition": "Saying Allahu-Akbar (Allah is the Most Great).",
        "arabic": "تكبير"
    },
    "Takbira": {
        "definition": "A single utterance of Allahu-Akbar.",
        "arabic": "تكبيرة"
    },
    "Talbina": {
        "definition": "A dish prepared from flour and honey.",
        "arabic": "تلبينة"
    },
    "Talbiya": {
        "definition": "Saying Labbaik, Allahumma Labbaik (O Allah! I am obedient to Your Orders, I respond to Your Call).",
        "arabic": "تلبية"
    },
    "Taqlid": {
        "definition": "Putting colored garlands around the necks of Budn (animals for sacrifice).",
        "arabic": "تقليد"
    },
    "Taribat Yaminuka": {
        "definition": "An expression of exhortation, meaning, 'May your right hand be in dust,' which implies a loss if you do not do as told.",
        "arabic": "تربت يمينك"
    },
    "Tarwiya (day of)": {
        "definition": "The eighth day of Dhul-Hijja, when pilgrims start going to Mina.",
        "arabic": "يوم التروية"
    },
    "Tarawih": {
        "definition": "Optional prayers offered after the Isha prayers on the nights of Ramadan.",
        "arabic": "تراويح"
    },
    "Tashah-hud": {
        "definition": "The recitation of the invocation: At-tahiyyatu Lillahi... while in Qu'ud (sitting posture) in prayer.",
        "arabic": "تشهد"
    },
    "Tashriq (days of)": {
        "definition": "11th, 12th, and 13th of Dhul-Hijja.",
        "arabic": "أيام التشريق"
    },
    "Tashmit": {
        "definition": "May Allah bestow His Blessings upon you.",
        "arabic": "تشميت"
    },
    "Taslim": {
        "definition": "On finishing the prayer, one turns one's face to the right and then to the left, saying, 'Assalamu 'Alaikum wa Rahmatullah' (Peace and Mercy of Allah be on you).",
        "arabic": "تسليم"
    },
    "Tauhid": {
        "definition": "It has three aspects: Oneness of the Lordship of Allah, Oneness of the worship of Allah, and Oneness of the Names and the Qualities of Allah.",
        "arabic": "توحيد"
    },
    "Tawaf": {
        "definition": "The circumambulation of the Ka'ba.",
        "arabic": "طواف"
    },
    "Tawaf-al-Ifada": {
        "definition": "The circumambulation of the Ka'ba by the pilgrims after they come from Mina on the tenth day of Dhul-Hijja.",
        "arabic": "طواف الإفاضة"
    },
    "Tawaf-ul-Wada'": {
        "definition": "The Tawaf made before leaving Makka.",
        "arabic": "طواف الوداع"
    },
    "Tayammum": {
        "definition": "To put or strike lightly the hands over clean earth and then pass the palm of each on the back of the other and then pass them on the face, performed instead of ablution or Ghusl when water is unavailable.",
        "arabic": "تيمم"
    },
    "Thaniyat-al-Wada'": {
        "definition": "A place near Al-Madina.",
        "arabic": "ثنية الوداع"
    },
    "Tharid": {
        "definition": "A kind of meal prepared from meat and bread.",
        "arabic": "ثريد"
    },
    "Thaur": {
        "definition": "A well-known mountain in Al-Madina.",
        "arabic": "ثور"
    },
    "Tila'": {
        "definition": "A kind of alcoholic drink prepared from grapes.",
        "arabic": "طلا"
    },
    "Tubban": {
        "definition": "Shorts that cover the knees, used by wrestlers.",
        "arabic": "تبان"
    },
    "Tulaqa'": {
        "definition": "Those persons who had embraced Islam on the day of the conquest of Makka.",
        "arabic": "طلقاء"
    },
    "Tur": {
        "definition": "A mountain.",
        "arabic": "طور"
    },
    "Uhud": {
        "definition": "A well-known mountain in Al-Madina, where one of the great battles in Islamic history took place.",
        "arabic": "أحد"
    },
    "'Umra": {
        "definition": "A visit to Makka during which one performs the Tawaf around the Ka'ba and the Sa'y between As-Safa and Al-Marwa.",
        "arabic": "عمرة"
    },
    "Umm-al-Walad": {
        "definition": "A slave woman who begets a child for her master.",
        "arabic": "أم الولد"
    },
    "Uqiya": {
        "definition": "128 grams. It may be less or more according to different countries.",
        "arabic": "أوقية"
    },
    "'Urfut": {
        "definition": "The tree which produces Maghafir.",
        "arabic": "عرفط"
    },
    "'Ushr": {
        "definition": "One-tenth of the yield of land to be levied for public assistance (Zakat).",
        "arabic": "عشر"
    },
    "Waihaka": {
        "definition": "May Allah be Merciful to you.",
        "arabic": "ويحك"
    },
    "Wailaka": {
        "definition": "'Woe upon you!'",
        "arabic": "ويلك"
    },
    "Wala'": {
        "definition": "A kind of relationship between the master who freed a slave and the freed slave.",
        "arabic": "ولاء"
    },
    "Wali [plural Auliya]": {
        "definition": "Protector, Guardian, Supporter, Helper, Friend, etc.",
        "arabic": "ولي"
    },
    "Walima": {
        "definition": "The marriage banquet.",
        "arabic": "وليمة"
    },
    "Waqf": {
        "definition": "Religious endowment.",
        "arabic": "وقف"
    },
    "Wars": {
        "definition": "A kind of perfume.",
        "arabic": "ورس"
    },
    "Wasaya": {
        "definition": "Wills or testaments.",
        "arabic": "وصايا"
    },
    "Wasq": {
        "definition": "A measure equal to 60 Sa's = 135 kg. approx.",
        "arabic": "وسق"
    },
    "Wisal": {
        "definition": "Fasting for more than one day continuously.",
        "arabic": "وصال"
    },
    "Witr": {
        "definition": "An odd number of Rak'at with which one finishes one's prayers at night after the night prayer or the Isha prayer.",
        "arabic": "وتر"
    },
    "Yakhsifan": {
        "definition": "Eclipse.",
        "arabic": "يخسفان"
    },
    "Yalamlam": {
        "definition": "The Miqat of the people of Yemen.",
        "arabic": "يلملم"
    },
    "Yamama": {
        "definition": "A place in Saudi Arabia towards Najd.",
        "arabic": "اليمامة"
    },
    "Yaqin": {
        "definition": "Perfect absolute Faith.",
        "arabic": "يقين"
    },
    "Yathrib": {
        "definition": "One of the names of Al-Madina.",
        "arabic": "يثرب"
    },
    "Zakat": {
        "definition": "A certain fixed proportion of the wealth and of the property liable to Zakat of a Muslim to be paid yearly for the benefit of the poor in the Muslim community. The payment of Zakat is obligatory as it is one of the five pillars of Islam.",
        "arabic": "زكاة"
    },
    "Zakat-ul-Fitr": {
        "definition": "An obligatory Sadaqa to be given by Muslims before the prayer of 'Eid-ul-Fitr.",
        "arabic": "زكاة الفطر"
    },
    "Zamzam": {
        "definition": "The sacred well inside the Haram (the grand mosque) at Makka.",
        "arabic": "زمزم"
    },
    "Zanadiqa": {
        "definition": "Atheists.",
        "arabic": "زنادقة"
    },
    "Zarnab": {
        "definition": "A kind of good smelling grass.",
        "arabic": "زرنب"
    },
    "Zuhr": {
        "definition": "Noon, mid-day prayer is called Zuhr prayer.",
        "arabic": "الظهر"
    }
}


